# 1. Базовый образ: берем готовую ОС с установленным Python
FROM python:3.11-slim

# 2. Папка внутри "виртуального компьютера", где будет лежать проект
WORKDIR /app

# 3. Сначала копируем только список библиотек (для быстрой сборки)
COPY requirements.txt .

# 4. Устанавливаем все нужные библиотеки
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем все остальные файлы твоего проекта (src, data, params.yaml и т.д.)
COPY . .

# 6. Команда, которая выполнится при запуске контейнера
# Она запустит твой пайплайн и обучит модель
CMD ["dvc", "repro"]